mtest> mtreset 360

mtest> mtnew 3

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 360 Bytes
* Number of blocks      : 1
* Free mem in last block: 216
* Recycle list          : 

=========================================
=             class MemTest             =
=========================================
Object list ---
ooo
Array list ---


mtest> mtdel -r 3

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 360 Bytes
* Number of blocks      : 1
* Free mem in last block: 216
* Recycle list          : 
[  0] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
oxx
Array list ---


mtest> mtnew 5 -a 3

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 360 Bytes
* Number of blocks      : 3
* Free mem in last block: 72
* Recycle list          : 
[  0] = 2         [  1] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
oxx
Array list ---
ooooo

mtest> mtdel -r 2 -a

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 360 Bytes
* Number of blocks      : 3
* Free mem in last block: 72
* Recycle list          : 
[  0] = 2         [  1] = 2         [  3] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
oxx
Array list ---
oooxx

mtest> mtnew -a 1 3

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 360 Bytes
* Number of blocks      : 3
* Free mem in last block: 16
* Recycle list          : 
[  0] = 2         [  3] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
oxx
Array list ---
oooxxooo

mtest> mtnew -a 6 6 

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 360 Bytes
* Number of blocks      : 9
* Free mem in last block: 88
* Recycle list          : 
[  0] = 2         [  1] = 5         [  3] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
oxx
Array list ---
oooxxooooooooo

mtest> mtnew -a 7 7 

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 360 Bytes
* Number of blocks      : 16
* Free mem in last block: 40
* Recycle list          : 
[  0] = 2         [  1] = 6         [  3] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
oxx
Array list ---
oooxxoooooooooooooooo

mtest> mtnew -a 8 8 

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 360 Bytes
* Number of blocks      : 24
* Free mem in last block: 0
* Recycle list          : 
[  0] = 2         [  1] = 6         [  3] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
oxx
Array list ---
oooxxoooooooooooooooooooooooo

mtest> mtnew -a 9 9 
Requested memory (408) is greater than block size(360). Exception raised...

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 360 Bytes
* Number of blocks      : 24
* Free mem in last block: 0
* Recycle list          : 
[  0] = 2         [  1] = 6         [  3] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
oxx
Array list ---
oooxxoooooooooooooooooooooooo

mtest> mtnew -a 10 10 
Requested memory (448) is greater than block size(360). Exception raised...

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 360 Bytes
* Number of blocks      : 24
* Free mem in last block: 0
* Recycle list          : 
[  0] = 2         [  1] = 6         [  3] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
oxx
Array list ---
oooxxoooooooooooooooooooooooo

mtest> mtnew -a 7 2

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 360 Bytes
* Number of blocks      : 26
* Free mem in last block: 40
* Recycle list          : 
[  0] = 2         [  1] = 6         [  3] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
oxx
Array list ---
oooxxoooooooooooooooooooooooooo

mtest> mtdel -r 8 -a

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 360 Bytes
* Number of blocks      : 26
* Free mem in last block: 40
* Recycle list          : 
[  0] = 2         [  1] = 7         [  3] = 2         [  6] = 3         
[  7] = 3         [  8] = 1         
=========================================
=             class MemTest             =
=========================================
Object list ---
oxx
Array list ---
oooxxoxoxoxxooxooxoxoooxooooooo

mtest> mtdel -i 12 -a

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 360 Bytes
* Number of blocks      : 26
* Free mem in last block: 40
* Recycle list          : 
[  0] = 2         [  1] = 7         [  3] = 2         [  6] = 4         
[  7] = 3         [  8] = 1         
=========================================
=             class MemTest             =
=========================================
Object list ---
oxx
Array list ---
oooxxoxoxoxxxoxooxoxoooxooooooo

mtest> q -f

