mtest> mtreset 280

mtest> mtnew 3

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 280 Bytes
* Number of blocks      : 1
* Free mem in last block: 136
* Recycle list          : 

=========================================
=             class MemTest             =
=========================================
Object list ---
ooo
Array list ---


mtest> mtdel -r 3

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 280 Bytes
* Number of blocks      : 1
* Free mem in last block: 136
* Recycle list          : 
[  0] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
xxo
Array list ---


mtest> mtnew 5 -a 3

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 280 Bytes
* Number of blocks      : 6
* Free mem in last block: 136
* Recycle list          : 
[  0] = 2         [  2] = 5         
=========================================
=             class MemTest             =
=========================================
Object list ---
xxo
Array list ---
ooooo

mtest> mtdel -r 2 -a

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 280 Bytes
* Number of blocks      : 6
* Free mem in last block: 136
* Recycle list          : 
[  0] = 2         [  2] = 5         [  3] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
xxo
Array list ---
xxooo

mtest> mtnew -a 1 3

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 280 Bytes
* Number of blocks      : 7
* Free mem in last block: 224
* Recycle list          : 
[  0] = 2         [  2] = 5         [  3] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
xxo
Array list ---
xxoooooo

mtest> mtnew -a 2 10

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 280 Bytes
* Number of blocks      : 9
* Free mem in last block: 184
* Recycle list          : 
[  0] = 2         [  1] = 1         [  3] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
xxo
Array list ---
xxoooooooooooooooo

mtest> mtnew -a 3 20

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 280 Bytes
* Number of blocks      : 26
* Free mem in last block: 136
* Recycle list          : 
[  0] = 2         [  1] = 1         [  2] = 16        
=========================================
=             class MemTest             =
=========================================
Object list ---
xxo
Array list ---
xxoooooooooooooooooooooooooooooooooooo

mtest> mtnew -a 4 30

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 280 Bytes
* Number of blocks      : 56
* Free mem in last block: 96
* Recycle list          : 
[  0] = 2         [  1] = 1         [  2] = 46        
=========================================
=             class MemTest             =
=========================================
Object list ---
xxo
Array list ---
xxoooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooo

mtest> #mtnew -a 5 5 
Illegal command!! (#mtnew)

mtest> #mtp
Illegal command!! (#mtp)

mtest> mtnew -a 6 6 

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 280 Bytes
* Number of blocks      : 62
* Free mem in last block: 8
* Recycle list          : 
[  0] = 2         [  1] = 1         [  2] = 47        
=========================================
=             class MemTest             =
=========================================
Object list ---
xxo
Array list ---
xxoooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooo

mtest> mtnew -a 7 7 
Requested memory (320) is greater than block size(280). Exception raised...

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 280 Bytes
* Number of blocks      : 62
* Free mem in last block: 8
* Recycle list          : 
[  0] = 2         [  1] = 1         [  2] = 47        
=========================================
=             class MemTest             =
=========================================
Object list ---
xxo
Array list ---
xxoooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooo

mtest> mtnew -a 8 8 
Requested memory (360) is greater than block size(280). Exception raised...

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 280 Bytes
* Number of blocks      : 62
* Free mem in last block: 8
* Recycle list          : 
[  0] = 2         [  1] = 1         [  2] = 47        
=========================================
=             class MemTest             =
=========================================
Object list ---
xxo
Array list ---
xxoooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooo

mtest> mtnew -a 9 9 
Requested memory (408) is greater than block size(280). Exception raised...

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 280 Bytes
* Number of blocks      : 62
* Free mem in last block: 8
* Recycle list          : 
[  0] = 2         [  1] = 1         [  2] = 47        
=========================================
=             class MemTest             =
=========================================
Object list ---
xxo
Array list ---
xxoooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooo

mtest> mtnew -a 10 10 
Requested memory (448) is greater than block size(280). Exception raised...

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 280 Bytes
* Number of blocks      : 62
* Free mem in last block: 8
* Recycle list          : 
[  0] = 2         [  1] = 1         [  2] = 47        
=========================================
=             class MemTest             =
=========================================
Object list ---
xxo
Array list ---
xxoooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooo

mtest> mtnew -a 7 2
Requested memory (320) is greater than block size(280). Exception raised...

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 280 Bytes
* Number of blocks      : 62
* Free mem in last block: 8
* Recycle list          : 
[  0] = 2         [  1] = 1         [  2] = 47        
=========================================
=             class MemTest             =
=========================================
Object list ---
xxo
Array list ---
xxoooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooo

mtest> mtdel -r 8 -a

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 280 Bytes
* Number of blocks      : 62
* Free mem in last block: 8
* Recycle list          : 
[  0] = 2         [  1] = 2         [  2] = 47        [  3] = 3         
[  4] = 3         [  6] = 1         
=========================================
=             class MemTest             =
=========================================
Object list ---
xxo
Array list ---
xxooxxoooooooooooooooooooxoooooooooxoooooooooxoxoo
oooooooooooooooxooooooxo

mtest> mtdel -i 12 -a

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 280 Bytes
* Number of blocks      : 62
* Free mem in last block: 8
* Recycle list          : 
[  0] = 2         [  1] = 2         [  2] = 48        [  3] = 3         
[  4] = 3         [  6] = 1         
=========================================
=             class MemTest             =
=========================================
Object list ---
xxo
Array list ---
xxooxxooooooxooooooooooooxoooooooooxoooooooooxoxoo
oooooooooooooooxooooooxo

mtest> mtnew -a 1 1 

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 280 Bytes
* Number of blocks      : 62
* Free mem in last block: 8
* Recycle list          : 
[  0] = 2         [  1] = 1         [  2] = 48        [  3] = 3         
[  4] = 3         [  6] = 1         
=========================================
=             class MemTest             =
=========================================
Object list ---
xxo
Array list ---
xxooxxooooooxooooooooooooxoooooooooxoooooooooxoxoo
oooooooooooooooxooooooxoo

mtest> mtnew 8  

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 280 Bytes
* Number of blocks      : 64
* Free mem in last block: 232
* Recycle list          : 
[  1] = 1         [  2] = 48        [  3] = 3         [  4] = 3         
[  6] = 1         
=========================================
=             class MemTest             =
=========================================
Object list ---
xxooooooooo
Array list ---
xxooxxooooooxooooooooooooxoooooooooxoooooooooxoxoo
oooooooooooooooxooooooxoo

mtest> mtnew -a 6 1

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 280 Bytes
* Number of blocks      : 64
* Free mem in last block: 232
* Recycle list          : 
[  1] = 1         [  2] = 48        [  3] = 3         [  4] = 3         

=========================================
=             class MemTest             =
=========================================
Object list ---
xxooooooooo
Array list ---
xxooxxooooooxooooooooooooxoooooooooxoooooooooxoxoo
oooooooooooooooxooooooxooo

mtest> q -f

